{
    "type": "report",
    "id": "report--3dd14153-c5b1-40bf-b7d2-bcb9e29da5d5",
    "created": "2024-06-04T14:49:01.220Z",
    "modified": "2024-06-04T14:49:01.220Z",
    "name": "Earth Krahang post train",
    "description": "Since early 2022, we have been monitoring an APT campaign that targets several government entities worldwide, with a strong focus in Southeast Asia, but also seen targeting Europe, America, and Africa. The threat actor exploits public-facing servers and sends spear phishing emails to deliver previously unseen backdoors. Our research allowed us to identify the campaign’s multiple connections with a China-nexus threat actor we track as Earth Lusca. However, since the campaign employs independent infrastructure and unique backdoors, we believe it to be a separate intrusion set that we named Earth Krahang. We will examine these connections, as well as potential links to a Chinese company named I-Soon, in a separate section. One of the threat actor’s favorite tactics involves using its malicious access to government infrastructure to attack other government entities, abusing the infrastructure to host malicious payloads, proxy attack traffic, and send spear-phishing emails to government-related targets using compromised government email accounts. Earth Krahang also uses other tactics, such as building VPN servers on compromised public-facing servers to establish access into the private network of victims and performing brute-force attacks to obtain email credentials. These credentials are then used to exfiltrate victim emails, with the group’s ultimate goal being cyberespionage. Due to mistakes on the attacker’s side, we managed to retrieve multiple files from Earth Krahang’s servers, including samples, configuration files, and log files from its attack tools. Combining this information with our telemetry helped us understand the Earth Krahang operation and build a clear view of the threat actor’s victimology and interests. In addition, we will also share their preferred malware families and post-exploitation tools in this report. One of the infection vectors used involves the scanning of public-facing servers. Earth Krahang heavily employs open-source scanning tools that perform recursive searches of folders such as .git or .idea. The threat actor also resorts to simply brute-forcing directories to help identify files that may contain sensitive information such as file paths or passwords on the victim’s servers. They also tend to examine the subdomains of their targets to find interesting and possible unmaintained servers. Earth Krahang also conducts vulnerability scanning with tools like sqlmap, nuclei, xray, vscan, pocsuite, and wordpressscan to find web server vulnerabilities  that will allow them to access the server, drop web shells, and install backdoors.  The threat actor abused the following vulnerabilities multiple times:  - CVE-2023-32315: command execution on OpenFire - CVE-2022-21587: command execution on Oracle Web Applications Desktop Integrator  Earth Krahang also makes use of spear phishing email to attack its targets. Like most spear phishing attacks, the emails are intended trick their targets into opening attachments or embedded URL links that ultimately lead to the execution of a prepared backdoor file on the victim’s machine. Our telemetry data and some of the group’s backdoors uploaded on VirusTotal revealed that the backdoor filenames are usually related to geopolitical topics, indicating their preferred type of lure:  - \"Plan of Action (POA) - TH-VN - TH_Counterdraft_as of Feb 2022.doc.exe\" - คำบอกกล่าวคำฟ้อง.rar (translated as “Notice of complaint.rar”) - “ร่างสถานะ ครม. รว. ไทย-โรมาเนีย as of 25 Feb 2022.doc.exe” (translated as “Draft Cabinet status of Thailand-Romania as of 25 Feb 2022.doc.exe”) - “Malaysian defense minister visits Hungary.Malaysian defense minister visits Hungary.exe” - “ICJ public hearings- Guyana vs. Venezuela.ICJ public hearings- Guyana vs. Venezuela.exe” - “On the visit of Paraguayan Foreign Minister to Turkmenistan.exe” - “pay-slip run persal payslip.pay-slip run persal payslip.docx.exe”  We noticed that Earth Krahang retrieves hundreds of email addresses from their targets during the reconnaissance phase. In one case, the actor used a compromised mailbox from a government entity to send a malicious attachment to 796 email addresses belonging to the same entity. The malicious attachment was a RAR archive containing an LNK file that deployed the Xdealer malware (which we will discuss in the Delivered malware families section) and opened a decoy document (available online) related to the governmental entity. It is likely that the actor discovered the weak credentials of the compromised mailbox using brute-forcing tools.  Earth Krahang abuses the trust between governments to conduct their attacks. We found that the group frequently uses compromised government webservers to host their backdoors and send download links to other government entities via spear phishing emails. Since the malicious link uses a legitimate government domain of the compromised server, it will appear less suspicious to targets and may even bypass some domain blacklists.  In addition, the actor used a compromised government email account to send email to other governments. We noticed the following email subjects being used for spear-phishing emails:  - salary - Malaysian Ministry of Defense Circular - Malaysian defense minister visits Hungary - ICJ public hearings- Guyana vs. Venezuela - About Guyana Procurement Proposal for Taiwan <redacted>  The threat actor installs the SoftEther VPN on compromised public-facing servers and uses certutil commands to download and install the SoftEther VPN server. The SoftEther server executable is renamed to either taskllst.exe, tasklist.exe, or tasklist_32.exe for the Windows executable and curl for the Linux executable to make it look like a legitimate file on the installed system. With the VPN server installed, the actor can then connect to the victim’s network to conduct their post-exploitation movements.  Additional post-exploitation movements include:  - Maintaining backdoor persistence with task scheduling - Enabling Remote Desktop connections by modifying the Windows Registry “fDenyTSConnections” - Accessing credentials by dumping Local Security Authority Subsystem Service (LSASS) with Mimikatz or ProcDump - Accessing credentials by dumping the SAM database (HKLM/sam) from the Windows Registry - Scanning the network using Fscan - Lateral code execution via WMIC - Using tools such as BadPotato, SweetPotato, GodPotato, or PrinterNotifyPotato for privilege escalation on Windows systems - Exploiting CVE-2021-4034, CVE-2021-22555, and CVE-2016-5195 for privilege escalation on Linux systems  We observed Earth Krahang conducting brute force attacks on Exchange servers via their Outlook on the web (formerly known as Outlook Web Access, or OWA) portals of its victims. The threat uses a list of common passwords to test the email accounts on the target’s email server.  We have observed the group using a custom Python script targeting the ActiveSync service on the OWA server to perform their brute-force attack.  We also found the threat actor using the open-source tool ruler to brute force email accounts and passwords. Email accounts using weak passwords can be identified by the attacker, who can then perform email exfiltration or abuse the compromised account to send spear phishing emails (as we discussed earlier).  We also identified another Python script that the actor used to exfiltrate emails from a Zimbra mail server. The script can package the victim’s mailbox via the mail server API using an authenticated cookie stolen by the threat actor. However, our investigation was unable to determine how the authenticated tokens were stolen from the victim’s server.  Earth Krahang delivers backdoors to establish access to victim machines. Cobalt Strike and two custom backdoors, RESHELL and XDealer, were employed during the initial stage of attack. We found that these backdoors were delivered either through spear-phishing emails or deployed via web shell on compromised servers.  We found the RESHELL backdoor being used several times in attacks during 2022. It was mentioned being used in a targeted attack against a Southeast Asian government by Palo Alto in a previous research report. RESHELL is a simple .NET backdoor that possesses the basic capabilities of collecting information, dropping files, or executing system commands. Its binaries are packed with ConfuserEX and its command-and-control (C&C) communication is encrypted with the AES algorithm.  Since 2023, the Earth Krahang shifted to another backdoor (named XDealer by TeamT5 and DinodasRAT by ESET). Compared to RESHELL, XDealer provides more comprehensive backdoor capabilities. In addition, we found that the threat actor employed both Windows and Linux versions of XDealer to target different systems. This finding indicates that the backdoor may have been used in the wild for some time now and is still under active development.  It's worth noting that many early XDealer samples were developed as a DLL file packaged with an installer, a stealer module DLL, a text file contents ID string, and an LNK file. The LNK file executes the installer, which then installs the XDealer DLL and the stealer module DLL on the victim’s machine. The stealer module can take screenshots, steal clipboard data, and log keystrokes.  In one case, we found that the LNK file was replaced with another executable, which is an installer loader (it’s likely that Earth Krahang employed a different execution scheme instead of a standalone executable). Furthermore, we found that some of the XDealer DLL loaders were signed with valid code signing certificates issued by GlobalSign to two Chinese companies. According to public information available on the internet, one is a human resource company, while the other is a game development company. It’s likely that their certificates were stolen and abused to sign malicious executables. Cobalt Strike was also frequently used during the initial stage of an attack. Interestingly, we found that instead of the typical Cobalt Strike usage, Earth Krahang adds additional protection to their C&C server through the adoption of the open-source project RedGuard, which is basically a proxy that helps red teams hinder the discovery of their Cobalt Strike C&C profile.  The threat actor abused RedGuard to prevent its C&C servers from being identified by blue team Cobalt Strike C&C scanners or search engine web crawlers. It also helps the group monitor who is collecting their C&C profiles. We found that Earth Krahang’s C&C server redirected invalid C&C requests to security vendor websites due to RedGuard’s protections.  Cobalt Strike exploits the DLL side-loading vulnerability. In one case we analyzed, the threat actor dropped three files, fontsets.exe, faultrep.dll, and faultrep.dat. The file fontsets.exe (SHA256: 97c668912c29b8203a7c3bd7d5d690d5c4e5da53) is a legitimate executable that was abused to side-load the DLL file faultrep.dll (SHA256: a94d0e51df6abbc4a7cfe84e36eb8f38bc011f46).  The faultrep.dll  file is a custom shellcode loader that will decode the encoded shellcode — which is Cobalt Strike — stored inside faultrep.dat. We also found another DLL loader with a similar decoding routine, but with different byte values for decoding and loads shellcode from a different filename (conf.data).  Using our telemetry data, we found that the threat actor also dropped PlugX and ShadowPad samples in victim environments. The PlugX sample, named fualtrep.dll, is likely used for side-loading, similar to the Cobalt Strike routine mentioned above. The ShadowPad samples had the exact same characteristics as seen in our previous Earth Lusca report.",
    "published": "2024-04-06T00:00:00Z",
    "object_refs": [
        "x-mitre-tactic--ffd5bcee-6e16-4dd2-8eca-7b3beedf33ca",
        "x-mitre-tactic--78b23412-0651-46d7-a540-170a1ce8bd5a",
        "x-mitre-tactic--7141578b-e50b-4dcc-bfa4-08a8dd689e9e",
        "x-mitre-tactic--4ca45d45-df4d-4613-8980-bac22d278fa5",
        "x-mitre-tactic--f72804c5-f15a-449e-a5da-2eecd181f813",
        "x-mitre-tactic--c17c5845-175e-4421-9713-829d0573dbc9",
        "x-mitre-tactic--5bc1d813-693e-4823-9961-abf9af4b0e92",
        "x-mitre-tactic--5e29b093-294e-49e9-a803-dab3d73b77dd",
        "x-mitre-tactic--d108ce10-2419-4cf9-a774-46161d6c6cfe",
        "x-mitre-tactic--2558fd61-8c75-4730-94c4-11926db2a263",
        "attack-pattern--b17a1a56-e99c-403c-8948-561df0cffe81",
        "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
        "attack-pattern--6aac77c4-eaf2-4366-8c13-ce50ab951f38",
        "attack-pattern--355be19c-ffc9-46d5-8d50-d6a036c675b6",
        "attack-pattern--7fd87010-3a00-4da3-b905-410525e8ec44",
        "attack-pattern--f4882e23-8aa7-4b12-b28a-b349c12ee9e0",
        "attack-pattern--35dd844a-b219-4e2b-a6bb-efa9a75995a9",
        "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
        "attack-pattern--7bc57495-ea59-4380-be31-a64af124ef18",
        "attack-pattern--9422fc14-1c43-410d-ab0f-a709b76c72dc",
        "attack-pattern--8c32eb4d-805f-4fc5-bf60-c4d476c131b5",
        "attack-pattern--7385dfaf-6886-4229-9ecd-6fd678040830",
        "attack-pattern--707399d6-ab3e-4963-9315-d9d3818cd6a0",
        "attack-pattern--20138b9d-1aac-4a26-8654-a36b6bbf2bba",
        "attack-pattern--56fca983-1cf1-4fd1-bda0-5e170a37ab59",
        "attack-pattern--0a3ead4e-6d47-4ccb-854c-a6a4f9d96b22",
        "attack-pattern--7dd95ff6-712e-4056-9626-312ea4ab4c5e",
        "attack-pattern--e358d692-23c0-4a31-9eb6-ecc13a8d7735",
        "attack-pattern--b2001907-166b-4d71-bb3c-9d26c871de09",
        "attack-pattern--03d7999c-1f4c-42cc-8373-e7690d318104",
        "attack-pattern--f879d51c-5476-431c-aedf-f14d207e4d1e",
        "attack-pattern--e3a12395-188d-4051-9a16-ea8e14d07b88"
    ],
    "labels": [
        "threat-report"
    ]
}