{
    "type": "report",
    "id": "report--d49e1718-23a3-4f84-bd46-64fe582cfdbc",
    "created": "2024-06-04T08:11:45.910Z",
    "modified": "2024-06-04T08:11:45.910Z",
    "name": "Earth Hudun Results",
    "description": "In our previous report, we introduced the sophisticated cyberespionage campaign orchestrated by Earth Hundun, a threat actor known for targeting the Asia-Pacific region using the Waterbear malware and its latest iteration, Deuterbear. We first observed Deuterbear being used by Earth Hundun in October 2022, and it has since been part of the group’s subsequent campaigns. Our analysis provided insights into the intricate workings of the downloader, detailing its infection flow, traffic behavior, anti-analysis techniques, and evolutionary trajectory. In this entry, we examine the behavior of the final Remote Access Trojan (RAT) that we recently managed to download from a C&C server, based on an Earth Hundun campaign from 2024. In our first entry, we focused on the Waterbear downloader (the first stage) and examined its network behavior. This report uses a case study to describe how the threat actor uses the Waterbear RAT and plugin during the second stage and how Waterbear downloaders are spread to other machines, making it more difficult to detect and track. Furthermore, we examine the major updates to Deuterbear, including the ability to accept plugins with shellcode formats and the ability to function even without handshakes during RAT operation. Finally, we will share our findings about the interaction between Earth Hundun and its victims through the Waterbear and Deuterbear malware, showcasing the sophisticated tactics employed by this threat actor.  First Stage Waterbear usually employs a group of three files for downloading purposes during the first stage of an attack (as mentioned in the previous report). These include the patched legitimate executable, the loader, and the encrypted downloader.  Second stage - After connecting to the C&C server, we downloaded the Waterbear RAT (A) in memory, which contains several command codes inside (see Table 1 for the list of RAT commands). In this case, the Waterbear RAT (A) was only used to download the Waterbear plugin via RAT command 1010 and activate the first export function, “Start”, in the plugin to inject the chosen process. - The Waterbear plugin contains Waterbear downloader versions 0.27 and 0.28, both unencrypted, varying based on the process's bit version. If the process is 32-bit, version 0.27 of the Waterbear downloader will run. On the other hand, version 0.28 will execute to facilitate further downloads on the 64-bit process.  Waterbear downloader versions 0.27 and 0.28 are the latest that we know of. Their behaviors are the same as the versions before 2020.  - In this case, the Waterbear plugin injects into a 64-bit process, which results in version 0.28 of the Waterbear downloader trying to connect to the new C&C IP address — which is assigned by Waterbear RAT (A)  —  and download Waterbear RAT (B), which is almost the same as the previous one, just with a different RSA key inside. - Waterbear RAT (B) will be used to collect the information from the infected machine, including the list of drives and files, and then further spread the Waterbear downloader to other machines. Interestingly, Earth Hundun will replace the C&C string with an internal IP address after downloading the new stage of the RAT or downloader. This is to erase activity traces or connect to other C&C servers in the victim's environment, showing that the threat actor can arbitrarily choose its connection targets.  In the first stage, the loader employs a basic XOR calculation to decrypt the downloader, facilitating the retrieval of the first stage RAT from the C&C server. Subsequently, the threat actor applies the first stage RAT to survey the victim’s system and identify an appropriate folder for persistence. This is where the second-stage Deuterbear components will be installed, including the loader with CryptUnprotectData decryption, the encrypted downloader, and associated registries (the decryption flow was discussed in the previous blog entry). In most of the infected systems, only the second stage Deuterbear is available. Our monitoring indicates that all components of the first stage Deuterbear are totally removed after the “persistence installation” is completed. It seems that Earth Hundun prefers to keep the loaders using CryptUnprotectData decryption, even in cases where the successful installation of Deuterbear is achieved during the first stage. This strategy effectively protects their tracks and prevents the malware from easily being analyzed by threat researchers, particularly in simulated environments rather than real victim systems.  The Deuterbear RAT directly inherits several components from the downloader, including:  - All anti-analysis techniques (please refer to our previous report for more details). - HTTPS tunnel. - Routine to receive and send traffic. - RC4 key to decrypt and encrypt traffic. - Routine to decrypt and encrypt the desired function. - Key to decrypt and encrypt the desired function.  Due to having the same HTTPS channel and RC4 traffic key, Deuterbear RAT doesn't require a handshake with the C&C server to update communication protocols. This enables the threat actor to seamlessly control the client, regardless of whether the process is in the downloader or RAT status. Prior to executing backdoor commands, the Deuterbear RAT transmits victim information to the C&C server via RAT command 975 with the structure (Table 3) highly reminiscent of the Waterbear RAT.  Comparing Deuterbear with Waterbear reveals several functionalities directly replicated from the Waterbear RAT, such as process management, file management, and remote shell capabilities.  Although Deuterbear streamlines its capabilities, retaining only 20 RAT commands (Table 4) compared to over 60 for Waterbear (Table 1), the Deuterbear RAT accepts more plugins to enhance flexibility and accommodate additional functionalities, including two shellcodes and a portable executable (PE) DLL via RAT command 979. After installing the plugins, the threat actor sends the next traffic to determine which plugin is launched. There are three kinds of protocols:  - Execute the first shellcode and the first export function of PE(DLL) - Execute the second shellcode and the first export function of PE(DLL) - Only execute the first export function of PE(DLL)",
    "published": "2024-04-06T00:00:00Z",
    "object_refs": [
        "x-mitre-tactic--f72804c5-f15a-449e-a5da-2eecd181f813",
        "x-mitre-tactic--5e29b093-294e-49e9-a803-dab3d73b77dd",
        "x-mitre-tactic--5bc1d813-693e-4823-9961-abf9af4b0e92",
        "x-mitre-tactic--d108ce10-2419-4cf9-a774-46161d6c6cfe",
        "x-mitre-tactic--7141578b-e50b-4dcc-bfa4-08a8dd689e9e",
        "x-mitre-tactic--2558fd61-8c75-4730-94c4-11926db2a263",
        "x-mitre-tactic--78b23412-0651-46d7-a540-170a1ce8bd5a",
        "x-mitre-tactic--c17c5845-175e-4421-9713-829d0573dbc9",
        "x-mitre-tactic--4ca45d45-df4d-4613-8980-bac22d278fa5",
        "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
        "attack-pattern--355be19c-ffc9-46d5-8d50-d6a036c675b6",
        "attack-pattern--35dd844a-b219-4e2b-a6bb-efa9a75995a9",
        "attack-pattern--43e7dc91-05b2-474c-b9ac-2ed4fe101f4d",
        "attack-pattern--9422fc14-1c43-410d-ab0f-a709b76c72dc",
        "attack-pattern--bb5a00de-e086-4859-a231-fa793f6797e2",
        "attack-pattern--7385dfaf-6886-4229-9ecd-6fd678040830",
        "attack-pattern--6faf650d-bf31-4eb4-802d-1000cf38efaf",
        "attack-pattern--7bc57495-ea59-4380-be31-a64af124ef18",
        "attack-pattern--1035cdf2-3e5f-446f-a7a7-e8f6d7925967",
        "attack-pattern--f879d51c-5476-431c-aedf-f14d207e4d1e",
        "attack-pattern--0259baeb-9f63-4c69-bf10-eb038c390688",
        "attack-pattern--b3d682b6-98f2-4fb0-aa3b-b4df007ca70a",
        "attack-pattern--7fd87010-3a00-4da3-b905-410525e8ec44",
        "attack-pattern--57340c81-c025-4189-8fa0-fc7ede51bae4",
        "attack-pattern--830c9528-df21-472c-8c14-a036bf17d665",
        "attack-pattern--354a7f88-63fb-41b5-a801-ce3b377b36f1",
        "attack-pattern--03d7999c-1f4c-42cc-8373-e7690d318104",
        "attack-pattern--731f4f55-b6d0-41d1-a7a9-072a66389aea",
        "attack-pattern--478aa214-2ca7-4ec0-9978-18798e514790",
        "attack-pattern--51dea151-0898-4a45-967c-3ebee0420484",
        "attack-pattern--8f4a33ec-8b1f-4b80-a2f6-642b2e479580",
        "attack-pattern--f72eb8a8-cd4c-461d-a814-3f862befbf00",
        "attack-pattern--0a3ead4e-6d47-4ccb-854c-a6a4f9d96b22"
    ],
    "labels": [
        "threat-report"
    ]
}